#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Reference to undefined provider

  on main.tf line 27, in module "domain_management":
  27:     aws           = aws

There is no explicit declaration for local provider name "aws" in
module.domain_management, so Terraform is assuming you mean to pass a
configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and one more similar warning elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.api.data.local_file.mock_response_get_files["about_page_content"]: Reading...
module.api.data.local_file.mock_response_get_files["featured_projects"]: Reading...
module.api.data.local_file.mock_response_get_files["featured_projects"]: Read complete after 0s [id=e32261d3c5c27bd4e8a1dd61ec4b12c695eae63f]
module.api.data.local_file.mock_response_get_files["about_page_content"]: Read complete after 0s [id=d3b845625b1da606b2782181d2fa37859285d76c]
module.domain_management.aws_route53_zone.thomaskimble: Refreshing state... [id=Z09261682MMR79C15BLZ9]
module.cdn.aws_cloudfront_origin_access_control.thomaskimble_origin_access_control: Refreshing state... [id=EL0VR2NKFTVMT]
module.frontend.data.aws_secretsmanager_secret.secret: Reading...
module.api.aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=ktjk0455h9]
module.domain_management.aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/36b7b09b-b03e-4036-8a14-dfd49c4e4fff]
module.storage.aws_s3_bucket.thomaskimble_bucket: Refreshing state... [id=thomaskimble-storage]
module.domain_management.aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z09261682MMR79C15BLZ9__MX]
module.domain_management.aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_email_CNAME]
module.domain_management.aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_autodiscover_CNAME]
module.domain_management.aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z09261682MMR79C15BLZ9__TXT]
module.domain_management.aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_legacy_CNAME]
module.frontend.data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
module.frontend.data.aws_secretsmanager_secret_version.current: Reading...
module.api.aws_api_gateway_resource.mock_get_resources["about_page_content"]: Refreshing state... [id=8em389]
module.api.aws_api_gateway_resource.mock_get_resources["featured_projects"]: Refreshing state... [id=kn1j9q]
module.frontend.data.aws_secretsmanager_secret_version.current: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
module.frontend.aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d212nepszzoptn]
module.domain_management.aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.api.aws_api_gateway_domain_name.thomaskimble_api_gateway_domain_name: Refreshing state... [id=api.thomaskimble.com]
module.domain_management.aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.api.aws_api_gateway_method.mock_get_methods["featured_projects"]: Refreshing state... [id=agm-ktjk0455h9-kn1j9q-GET]
module.api.aws_api_gateway_method.mock_get_methods["about_page_content"]: Refreshing state... [id=agm-ktjk0455h9-8em389-GET]
module.domain_management.aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=2024-05-15 15:03:21.971 +0000 UTC]
module.domain_management.aws_route53_record.thomaskimble_api_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_api_A]
module.api.aws_api_gateway_method_response.mock_get_method_responses["about_page_content"]: Refreshing state... [id=agmr-ktjk0455h9-8em389-GET-200]
module.api.aws_api_gateway_method_response.mock_get_method_responses["featured_projects"]: Refreshing state... [id=agmr-ktjk0455h9-kn1j9q-GET-200]
module.api.aws_api_gateway_integration.mock_get_integrations["about_page_content"]: Refreshing state... [id=agi-ktjk0455h9-8em389-GET]
module.api.aws_api_gateway_integration.mock_get_integrations["featured_projects"]: Refreshing state... [id=agi-ktjk0455h9-kn1j9q-GET]
module.api.aws_api_gateway_integration_response.mock_get_integration_responses["about_page_content"]: Refreshing state... [id=agir-ktjk0455h9-8em389-GET-200]
module.api.aws_api_gateway_integration_response.mock_get_integration_responses["featured_projects"]: Refreshing state... [id=agir-ktjk0455h9-kn1j9q-GET-200]
module.api.aws_api_gateway_deployment.api_deployment: Refreshing state... [id=zzvq0i]
module.api.aws_api_gateway_stage.thomaskimble_prod: Refreshing state... [id=ags-ktjk0455h9-prod]
module.frontend.aws_amplify_branch.main: Refreshing state... [id=d212nepszzoptn/main]
module.frontend.aws_amplify_branch.dev: Refreshing state... [id=d212nepszzoptn/dev]
module.api.aws_api_gateway_base_path_mapping.thomaskimble_api_gateway_mapping: Refreshing state... [id=api.thomaskimble.com/]
module.frontend.aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d212nepszzoptn/thomaskimble.com]
module.storage.aws_s3_bucket_policy.thomaskimble_bucket_policy: Refreshing state... [id=thomaskimble-storage]
module.storage.aws_s3_bucket_ownership_controls.thomaskimble_bucket_acl_ownership: Refreshing state... [id=thomaskimble-storage]
module.storage.aws_s3_bucket_acl.thomaskimble_bucket_acl: Refreshing state... [id=thomaskimble-storage,public-read]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cdn.aws_cloudfront_distribution.thomaskimble_cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "thomaskimble_cloudfront_distribution" {
      + aliases                         = [
          + "storage.thomaskimble.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "S3-thomaskimble-storage"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "thomaskimble-storage.s3.eu-west-1.amazonaws.com"
          + origin_access_control_id = "EL0VR2NKFTVMT"
          + origin_id                = "S3-thomaskimble-storage"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2018"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.domain_management.aws_acm_certificate.thomaskimble_certificate_us_east_1 will be created
  + resource "aws_acm_certificate" "thomaskimble_certificate_us_east_1" {
      + arn                       = (known after apply)
      + domain_name               = "thomaskimble.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.thomaskimble.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "thomaskimble.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.thomaskimble.com",
          + "thomaskimble.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.domain_management.aws_acm_certificate_validation.thomaskimble_certificate_validation_us_east_1 will be created
  + resource "aws_acm_certificate_validation" "thomaskimble_certificate_validation_us_east_1" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = [
          + "_fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com",
        ]
    }

  # module.domain_management.aws_route53_record.thomaskimble_storage_record will be created
  + resource "aws_route53_record" "thomaskimble_storage_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "storage"
      + type            = "A"
      + zone_id         = "Z09261682MMR79C15BLZ9"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 27, in module "domain_management":
  27:     aws           = aws

There is no explicit declaration for local provider name "aws" in
module.domain_management, so Terraform is assuming you mean to pass a
configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*